---
kind: method
id: M:Autodesk.Revit.DB.FamilyParameterSet.Insert(Autodesk.Revit.DB.FamilyParameter)
source: html/f592b943-6a72-cdef-594e-b85038c93c68.htm
---
# Autodesk.Revit.DB.FamilyParameterSet.Insert Method

## Syntax (C#)
```csharp
public virtual bool Insert(
	FamilyParameter item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.FamilyParameter`)